In [1]:
import pandas as pd
import numpy as np 
import matplotlib as mpl
import seaborn as sns

In [2]:
FEATURE = "Fertility_Rate"
df = pd.read_csv("..\..\datasets\Original\%s.csv" % FEATURE)
df

,Country Name,Country Code,Series Name,Series Code,2016 [YR2016],2017 [YR2017],2018 [YR2018],2019 [YR2019],2020 [YR2020]
0,Afghanistan,AFG,"Fertility rate, total (births per woman)",SP.DYN.TFRT.IN,4.8,4.633,4.473,4.321,4.176
1,Albania,ALB,"Fertility rate, total (births per woman)",SP.DYN.TFRT.IN,1.659,1.638,1.617,1.597,1.58
2,Algeria,DZA,"Fertility rate, total (births per woman)",SP.DYN.TFRT.IN,3.052,3.045,3.023,2.988,2.942
3,American Samoa,ASM,"Fertility rate, total (births per woman)",SP.DYN.TFRT.IN,..,..,..,..,..
4,Andorra,AND,"Fertility rate, total (births per woman)",SP.DYN.TFRT.IN,..,..,..,..,..
...,...,...,...,...,...,...,...,...,...
266,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
267,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
268,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
269,Data from database: World Development Indicators,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
270,Last Updated: 09/16/2022,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Skeleton dataframe

In [3]:
columns = ["Country Code"]
df.drop_duplicates(subset=columns, keep="first")
df_new = df[columns[0]].unique()
df_new = pd.DataFrame(df_new, columns=columns)
df.rename(columns={"Country Code": "ISO3_Code"}, inplace=True)
df_new.rename(columns={"Country Code": "ISO3_Code"}, inplace=True)
df_new.shape

(267, 1)

In [4]:
df_code = pd.read_csv("../../datasets/Original/AreaCode_ISO3Code_conversion.csv")
df_code = df_code[["Country", "ISO3 Code", "M49 Code"]]
df_new = df_new.join(df_code.set_index("ISO3 Code"), on="ISO3_Code", validate="1:1")
df_new

    ISO3_Code         Country  M49 Code
0         AFG     Afghanistan       4.0
1         ALB         Albania       8.0
2         DZA         Algeria      12.0
3         ASM  American Samoa      16.0
4         AND         Andorra      20.0
..        ...             ...       ...
262       SSA             NaN       NaN
263       TSS             NaN       NaN
264       UMC             NaN       NaN
265       WLD             NaN       NaN
266       NaN             NaN       NaN

[267 rows x 3 columns]

In [5]:
df_new.rename(columns={"ISO3 Code": "ISO3_Code", "Country": "Country_Name", "M49 Code": "M49_Code"}, inplace=True)
df_new.head()

  ISO3_Code    Country_Name  M49_Code
0       AFG     Afghanistan       4.0
1       ALB         Albania       8.0
2       DZA         Algeria      12.0
3       ASM  American Samoa      16.0
4       AND         Andorra      20.0

In [6]:
df_new[df_new["Country_Name"].isnull()]

    ISO3_Code Country_Name  M49_Code
39        CHI          NaN       NaN
105       XKX          NaN       NaN
217       AFE          NaN       NaN
218       AFW          NaN       NaN
219       ARB          NaN       NaN
220       CSS          NaN       NaN
221       CEB          NaN       NaN
222       EAR          NaN       NaN
223       EAS          NaN       NaN
224       EAP          NaN       NaN
225       TEA          NaN       NaN
226       EMU          NaN       NaN
227       ECS          NaN       NaN
228       ECA          NaN       NaN
229       TEC          NaN       NaN
230       EUU          NaN       NaN
231       FCS          NaN       NaN
232       HPC          NaN       NaN
233       HIC          NaN       NaN
234       IBD          NaN       NaN
235       IBT          NaN       NaN
236       IDB          NaN       NaN
237       IDX          NaN       NaN
238       IDA          NaN       NaN
239       LTE          NaN       NaN
240       LCN          NaN       NaN
241       LAC          NaN       NaN
242       TLA          NaN       NaN
243       LDC          NaN       NaN
244       LMY          NaN       NaN
245       LIC          NaN       NaN
246       LMC          NaN       NaN
247       MEA          NaN       NaN
248       MNA          NaN       NaN
249       TMN          NaN       NaN
250       MIC          NaN       NaN
251       NAC          NaN       NaN
252       INX          NaN       NaN
253       OED          NaN       NaN
254       OSS          NaN       NaN
255       PSS          NaN       NaN
256       PST          NaN       NaN
257       PRE          NaN       NaN
258       SST          NaN       NaN
259       SAS          NaN       NaN
260       TSA          NaN       NaN
261       SSF          NaN       NaN
262       SSA          NaN       NaN
263       TSS          NaN       NaN
264       UMC          NaN       NaN
265       WLD          NaN       NaN
266       NaN          NaN       NaN

In [7]:
# drop the null rows cause it's the legend
df_new.dropna(inplace=True)
df_new

    ISO3_Code                  Country_Name  M49_Code
0         AFG                   Afghanistan       4.0
1         ALB                       Albania       8.0
2         DZA                       Algeria      12.0
3         ASM                American Samoa      16.0
4         AND                       Andorra      20.0
..        ...                           ...       ...
212       VIR  United States Virgin Islands     850.0
213       PSE                     Palestine     275.0
214       YEM                         Yemen     887.0
215       ZMB                        Zambia     894.0
216       ZWE                      Zimbabwe     716.0

[215 rows x 3 columns]

## Unemployment
Unemployment (% of labor force)

In [8]:
df_tmp = pd.concat([df.loc[:, ["ISO3_Code"]], df.iloc[:, -5:]], axis=1)
df_new = df_new.merge(df_tmp, on="ISO3_Code", how="inner")
columns = df.columns[-5:].values
names_dict = {}
for i, column in enumerate(columns):
    names_dict[column] = "%s_%s" % (FEATURE, column[:4])
df_new.rename(columns=names_dict, inplace=True)
df_new

,ISO3_Code,Country_Name,M49_Code,Fertility_Rate_2016,Fertility_Rate_2017,Fertility_Rate_2018,Fertility_Rate_2019,Fertility_Rate_2020
0,AFG,Afghanistan,4.0,4.8,4.633,4.473,4.321,4.176
1,ALB,Albania,8.0,1.659,1.638,1.617,1.597,1.58
2,DZA,Algeria,12.0,3.052,3.045,3.023,2.988,2.942
3,ASM,American Samoa,16.0,..,..,..,..,..
4,AND,Andorra,20.0,..,..,..,..,..
...,...,...,...,...,...,...,...,...
210,VIR,United States Virgin Islands,850.0,2.09,2.08,2.06,2.05,2.03
211,PSE,Palestine,275.0,3.844,3.738,3.643,3.56,3.489
212,YEM,Yemen,887.0,3.994,3.89,3.792,3.7,3.614
213,ZMB,Zambia,894.0,4.814,4.718,4.633,4.559,4.496
214,ZWE,Zimbabwe,716.0,3.804,3.707,3.615,3.531,3.46

In [9]:
# add a column for average over the years
columns = df_new.columns[-5:]
df_cols = df_new[columns].applymap(lambda x: float(x) if x not in ["", None, ".."] else None)
df_new = pd.concat([df_new.iloc[:, :3], df_cols], axis=1)
df_new["%s_Avg" % FEATURE] = df_new[columns].mean(axis=1)
df_new.head()

,ISO3_Code,Country_Name,M49_Code,Fertility_Rate_2016,Fertility_Rate_2017,Fertility_Rate_2018,Fertility_Rate_2019,Fertility_Rate_2020,Fertility_Rate_Avg
0,AFG,Afghanistan,4.0,4.800,4.633,4.473,4.321,4.176,4.4806
1,ALB,Albania,8.0,1.659,1.638,1.617,1.597,1.580,1.6182
2,DZA,Algeria,12.0,3.052,3.045,3.023,2.988,2.942,3.0100
3,ASM,American Samoa,16.0,NaN,NaN,NaN,NaN,NaN,NaN
4,AND,Andorra,20.0,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
# prettify the float
#df_new = df_new[df_new.columns[-6:]].applymap(na_action='ignore', func=lambda x: ".6f" % x)
with open("../../datasets/Processed/%s_Processed.csv" % FEATURE, "w", encoding="utf8") as f:
    df_new.to_csv(f, lineterminator="\n", index=False)

## Stats

In [11]:
df_new.isnull().sum()

ISO3_Code               0
Country_Name            0
M49_Code                0
Fertility_Rate_2016    17
Fertility_Rate_2017    17
Fertility_Rate_2018    17
Fertility_Rate_2019    17
Fertility_Rate_2020    17
Fertility_Rate_Avg     17
dtype: int64